# 파이썬으로 배우는 통계학 교과서
## 3.10. 분할표 검정

### 분석 준비

In [1]:
import numpy as np
import pandas as pd
import scipy as sp
from scipy import stats

from matplotlib import pyplot as plt
import seaborn as sns
sns.set()

%precision 3
%matplotlib inline

### 분할표 검정

In [2]:
click_data1 = pd.read_csv("3-10-1-click_data2.csv")
click_data1.head(10)

  Color  Click
0   red  click
1   red    not
2   red    not
3   red    not
4   red    not
5  blue  click
6  blue  click
7  blue    not
8  blue    not
9  blue    not

In [3]:
cross = pd.crosstab(click_data1.Color, click_data1.Click)
cross

Click  click  not
Color
blue       2   23
red        1    4

In [4]:
# 분할표 검정 = 카이 제곱 검정 (chi^2 test)
sp.stats.chi2_contingency(cross, correction = False)

Chi2ContingencyResult(statistic=np.float64(0.6666666666666667), pvalue=np.float64(0.4142161782425252), dof=1, expected_freq=array([[ 2.5, 22.5],
       [ 0.5,  4.5]]))

In [5]:
click_data2 = pd.concat([click_data1, click_data1.head(5), click_data1.head(5), click_data1.head(5), click_data1.head(5)])
cross2 = pd.crosstab(click_data2.Color, click_data2.Click)
cross2

Click  click  not
Color
blue       2   23
red        5   20

In [10]:
sp.stats.chi2_contingency(cross2, correction = False)

Chi2ContingencyResult(statistic=np.float64(1.495016611295681), pvalue=np.float64(0.2214397326720097), dof=1, expected_freq=array([[ 3.5, 21.5],
       [ 3.5, 21.5]]))

In [11]:
# 분할표 검정 예시: 타이타닉 데이터셋

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [12]:
cross = pd.crosstab(titanic.sex, titanic.alive)
cross

alive    no  yes
sex
female   81  233
male    468  109

In [13]:
sp.stats.chi2_contingency(cross, correction = False)

Chi2ContingencyResult(statistic=np.float64(263.05057407065567), pvalue=np.float64(3.7117477701134244e-59), dof=1, expected_freq=array([[193.475, 120.525],
       [355.525, 221.475]]))